# $\textrm{Introdution and Background}$

# $\textrm{Data Description}$

# $\textrm{Data Cleaning/Pre-processing}$

In [1]:
import pandas as pd
import numpy as np
import scipy.interpolate as sp_interpolate

In [2]:
# our original wishlist of cities
cities = [
    "Birmingham, AL",
    "Montgomery, AL",
    "Anchorage, AK",
    "Juneau, AK",
    "Phoenix, AZ",
    "Tucson, AZ",
    "Little Rock, AR",
    "Fort Smith, AR",
    "San Diego, CA",
    "Los Angeles, CA",
    "Sacramento, CA",
    "Denver, CO",
    "Colorado Springs, CO",
    "Aurora, CO",
    "Bridgeport, CT",
    "Hartford, CT",
    "Dover, DE",
    "Wilmington, DE",
    "Jacksonville, FL",
    "Miami, FL",
    "Tallahassee, FL",
    "Atlanta, GA",
    "Savannah, GA",
    "Honolulu, HI",
    "Kauai, HI",
    "Maui, HI",
    "Boise, ID",
    "Meridian, ID",
    "Chicago, IL",
    "Springfield, IL",
    "Fort Wayne, IN",
    "Indianapolis, IN",
    "Cedar Rapids, IA",
    "Des Moines, IA",
    "Topeka, KS",
    "Wichita, KS",
    "Frankfort, KY",
    "Louisville, KY",
    "Baton Rouge, LA",
    "New Orleans, LA",
    "Augusta, ME",
    "Portland, ME",
    "Baltimore, MD",
    "Annapolis, MD",
    "Boston, MA",
    "Worcester, MA",
    "Detroit, MA",
    "Lansing, MA",
    "Minneapolis, MN",
    "Saint Paul, MN",
    "Jackson, MS",
    "Gulfport, MS",
    "Kansas City, MO",
    "Jefferson City, MO",
    "Billings, MT",
    "Helena, MT",
    "Lincoln, NE",
    "Omaha, NE",
    "Carson City, NV",
    "Las Vegas, NV",
    "Reno, NV",
    "Concord, NH",
    "Manchester, NH",
    "Newark, NJ",
    "Trenton, NJ",
    "Albuquerque, NM",
    "Santa Fe, NM",
    "Albany, NY",
    "New York City, NY",
    "Charlotte, NC",
    "Raleigh, NC",
    "Bismarck, ND",
    "Fargo, ND",
    "Columbus, OH",
    "Cleveland, OH",
    "Oklahoma City, OK",
    "Tulsa, OK",
    "Portland, OR",
    "Salem, OR",
    "Harrisburg, PA",
    "Philadelphia, PA",
    "Providence, RI",
    "Warwick, RI",
    "Charleston, SC",
    "Columbia, SC",
    "Pierre, SD",
    "Sioux Falls, SD",
    "Nashville, TN",
    "Memphis, TN",
    "Austin, TX",
    "El Paso, TX",
    "Houston, TX",
    "Salt Lake City, UT",
    "West Valley City, UT",
    "Burlington, VT",
    "Montpelier, VT",
    "Richmond, VA",
    "Virginia Beach, VA",
    "Olympia, WA",
    "Seattle, WA",
    "Charleston, WV",
    "Huntington, WV",
    "Madison, WI",
    "Milwaukee, WI",
    "Casper, WY",
    "Cheyenne, WY"
]

## Income

In [3]:
income = pd.read_csv('Income_Data/cities_median_income.csv')
income.head()

,City,Median Income 2016,Median Income 2015,Median Income 2014,Median Income 2013,Median Income 2012,Median Income 2011,Median Income 2010
0,"Birmingham, AL","46,346","44,463","44,447","44,716","44,710","45,423","45,198"
1,"Montgomery, AL","63,847","62,201","62,568","62,418","61,896","62,645","61,229"
2,"Anchorage, AK","102,500","99,630","98,317","96,935","95,632","94,073","91,251"
3,"Juneau, AK","104,005","102,355","97,588","96,025","95,433","93,994","89,373"
4,"Phoenix, AZ","69,216","66,345","65,770","65,199","65,968","66,709","66,996"

In [4]:
# rename columns
income.columns = ['city', '2016', '2015', '2014', '2013', '2012', '2011', '2010']

In [5]:
# capitalize "city" in "Salt Lake City"
income.loc[income['city'] == "Salt Lake city, UT", 'city'] = "Salt Lake City, UT"

In [6]:
# unpivot
income = pd.melt(income, id_vars=['city'], var_name='year', value_name='median income') \
           .sort_values(['city', 'year']) \
           .reset_index(drop=True)

In [7]:
# convert strings to numbers
income['median income'] = income['median income'].map(lambda value: int(value.replace(',', '')))

In [8]:
# convert to MultiIndex
income.set_index(['city', 'year'], inplace=True)

In [9]:
income.head()

                 median income
city       year
Albany, NY 2010          73470
           2011          75821
           2012          76707
           2013          77687
           2014          78285

## Unemployment

In [10]:
unemployment = pd.read_csv('Income_Data/cities_unemployment_rate.csv')
unemployment.head()

,City,Unemployment Rate 2016,Unemployment Rate 2015,Unemployment Rate 2014,Unemployment Rate 2013,Unemployment Rate 2012,Unemployment Rate 2011,Unemployment Rate 2010
0,"Birmingham, AL",11.8%,13.3%,14.5%,15.3%,14.5%,13.6%,12.9%
1,"Montgomery, AL",8.4%,8.8%,8.9%,8.9%,8.7%,8.6%,7.9%
2,"Anchorage, AK",6.0%,6.7%,6.9%,7.3%,7.3%,7.2%,7.4%
3,"Juneau, AK",4.9%,5.2%,5.6%,5.3%,5.1%,5.3%,5.8%
4,"Phoenix, AZ",7.7%,8.8%,9.9%,10.6%,9.7%,8.7%,7.4%

In [11]:
# rename columns
unemployment.columns = ['city', '2016', '2015', '2014', '2013', '2012', '2011', '2010']

In [12]:
# capitalize "city" in "Salt Lake City"
unemployment.loc[unemployment['city'] == "Salt Lake city, UT", 'city'] = "Salt Lake City, UT"

In [13]:
# unpivot
unemployment = pd.melt(unemployment, id_vars=['city'], var_name='year', value_name='unemployment rate') \
                 .sort_values(['city', 'year']) \
                 .reset_index(drop=True)

In [14]:
# convert percentages to decimals
unemployment['unemployment rate'] = unemployment['unemployment rate'] \
                                    .map(lambda rate: float(rate.rstrip('%'))/100)

In [15]:
# convert to MultiIndex
unemployment.set_index(['city', 'year'], inplace=True)

In [16]:
unemployment.head()

                 unemployment rate
city       year
Albany, NY 2010              0.060
           2011              0.065
           2012              0.070
           2013              0.073
           2014              0.068

## Traffic

In [17]:
traffic = pd.read_csv('Income_Data/cities_mean_commute_time.csv')
traffic.head()

,City,Mean Commute Time 2016,Mean Commute Time 2015,Mean Commute Time 2014,Mean Commute Time 2013,Mean Commute Time 2012,Mean Commute Time 2011,Mean Commute Time 2010
0,"Birmingham, AL",21.4,21.4,21.6,21.7,21.8,21.7,22.0
1,"Montgomery, AL",20.0,19.3,19.5,19.3,19.5,19.5,19.7
2,"Anchorage, AK",19.1,19.5,19.4,19.4,19.0,18.6,18.2
3,"Juneau, AK",15.6,15.1,14.8,15.1,15.5,15.2,15.3
4,"Phoenix, AZ",25.1,24.8,24.5,24.4,24.4,24.7,24.8

In [18]:
# rename columns
traffic.columns = ['city', '2016', '2015', '2014', '2013', '2012', '2011', '2010']

In [19]:
# capitalize "city" in "Salt Lake City"
traffic.loc[traffic['city'] == "Salt Lake city, UT", 'city'] = "Salt Lake City, UT"

In [20]:
# unpivot
traffic = pd.melt(traffic, id_vars=['city'], var_name='year', value_name='mean commute time') \
           .sort_values(['city', 'year']) \
           .reset_index(drop=True)

In [21]:
# convert to MultiIndex
traffic.set_index(['city', 'year'], inplace=True)

In [22]:
traffic.head()

                 mean commute time
city       year
Albany, NY 2010               19.7
           2011               19.9
           2012               20.0
           2013               20.0
           2014               20.1

## Crime

In [23]:
crime = pd.read_pickle('crime_data/crime_data.pkl')
crime.head()

                    arson assault burglary murder rape robbery  theft  \
city           year
Birmingham, AL 2002   211    1697     4389     65  239    1186  11640
               2003   175    1706     4831     85  204    1352  11934
               2004   142    1593     5156     59  240    1369  11970
               2005   136    1675     4933    104  241    1429  11962
               2006   228    1422     4813    104  220    1429  12113

                    vehicle theft population
city           year
Birmingham, AL 2002          2049        NaN
               2003          2809        NaN
               2004          2351        NaN
               2005          2028        NaN
               2006          2081        NaN

In [24]:
# only keep 2009â€“2016
crime.drop([str(year) for year in range(2000, 2008+1)], level='year', inplace=True)

In [25]:
# the only population value we're missing (2009 onward) is Chicago 2013,
# so we'll fill it with the mean of Chicago's 2012 and 2014 populations
crime.loc['Chicago, IL', '2013'].loc['population'] \
    = crime.loc['Chicago, IL'].loc[['2012', '2014'], 'population'].mean()

In [26]:
# rescale crime values to occurence per capita
for col_name in crime.columns:
    crime[col_name] = crime[col_name]/crime['population']
crime.drop('population', axis=1, inplace=True)
# append "rate" to column names
crime.rename(columns=lambda col_name: col_name + " rate", inplace=True)

In [27]:
# These cities are missing all data points for these metrics,
# so we'll fill those with zeros
crime.loc['Boston, MA', 'arson rate'] = 0
crime.loc['New York City, NY', 'arson rate'] = 0
crime.loc['Huntington, WV', 'burglary rate'] = 0

In [28]:
# These cities are missing half or more data points for these metrics,
# so we'll fill them with the means of the available data points for those metrics for each city
crime.loc['Montgomery, AL', 'arson rate'] =   crime.loc['Montgomery, AL', 'arson rate']                   \
                                              .fillna(crime.loc['Montgomery, AL', 'arson rate'].mean())   \
                                              .values
crime.loc['Tucson, AZ', 'theft rate'] =       crime.loc['Tucson, AZ', 'theft rate']                       \
                                              .fillna(crime.loc['Tucson, AZ', 'theft rate'].mean())       \
                                              .values
crime.loc['New Orleans, LA', 'arson rate'] =  crime.loc['New Orleans, LA', 'arson rate']                  \
                                              .fillna(crime.loc['New Orleans, LA', 'arson rate'].mean())  \
                                              .values
crime.loc['Philadelphia, PA', 'arson rate'] = crime.loc['Philadelphia, PA', 'arson rate']                 \
                                              .fillna(crime.loc['Philadelphia, PA', 'arson rate'].mean()) \
                                              .values

In [29]:
# These cities are missing just a few data points,
# so we'll fill them by linear interpolation
def interpolate_crime_data(series):
    x = series.dropna().index.values.astype(int) # year
    y = series.dropna().values # data
    
    f = sp_interpolate.interp1d(x, y, fill_value='extrapolate')
    x_all = series.index.values.astype(int)
    return f(x_all)

missing_data = [
    ('Birmingham, AL', 'arson rate'),
    ('Phoenix, AZ', 'arson rate'),
    ('Chicago, IL', 'arson rate'),
    ('Chicago, IL', 'assault rate'),
    ('Chicago, IL', 'rape rate'),
    ('Indianapolis, IN', 'arson rate'),
    ('Topeka, KS', 'arson rate'),
    ('Louisville, KY', 'arson rate'),
    ('Lincoln, NE', 'arson rate'),
    ('Omaha, NE', 'arson rate'),
    ('Albuquerque, NM', 'arson rate'),
    ('Santa Fe, NM', 'arson rate'),
    ('Albany, NY', 'arson rate'),
    ('Columbus, OH', 'arson rate'),
    ('Providence, RI', 'vehicle theft rate'),
    ('West Valley City, UT', 'burglary rate'),
    ('Madison, WI', 'arson rate')
]

for city, injustice in missing_data:
    crime.loc[city, injustice] = interpolate_crime_data(crime.loc[city, injustice])

In [30]:
crime.head()

                      arson rate assault rate burglary rate  murder rate  \
city           year
Birmingham, AL 2009  0.000593738   0.00615289     0.0220739  0.000285874
               2011  0.000576766   0.00898442     0.0272252  0.000253214
               2012  0.000548611   0.00954207      0.022057  0.000314162
               2013  0.000616101   0.00774525     0.0189527  0.000297168
               2014  0.000683591   0.00982486     0.0176791   0.00024515

                       rape rate robbery rate theft rate vehicle theft rate
city           year
Birmingham, AL 2009  0.000870816   0.00505777    0.05078         0.00701051
               2011  0.000853426   0.00474074  0.0493393         0.00709469
               2012  0.000712725   0.00460927  0.0423978         0.00488592
               2013  0.000839619   0.00457073  0.0408536         0.00697167
               2014  0.000858025   0.00495486  0.0412182         0.00676991

## Happiness

In [31]:
happiness = pd.read_csv('Happy_Data/timeline_happy.csv')
happiness.head()

                           Geography  2014  2015  2016
0                          Akron, OH  57.7  60.3  61.7
1        Albany-Schenectady-Troy, NY  59.2  60.8  59.9
2                    Albuquerque, NM  60.3  57.0  59.4
3  Allentown-Bethlehem-Easton, PA-NJ  61.2  60.4  61.2
4                      Anchorage, AK  65.7   NaN  64.4

In [32]:
# rename columns
happiness.columns = ['city', '2014', '2015', '2016']

In [33]:
# why is there an extra comma in this one??
happiness.loc[happiness['city'] == "Fayetteville, Springdale-Rogers, AR-MO", 'city'] \
    = "Fayetteville-Springdale-Rogers, AR-MO"

In [34]:
# filter out regions not on our wishlist, and rename regions to cities accordingly
def rename_regions(region):
    region_city_words, region_states = [area.replace('-', ' ').split() for area in region.split(", ")]
    for city_words, state in [(city.split(), state) for city, state in [city.split(", ") for city in cities]]:
        # reconstruct "City, STATE" becuase I like the way I wrote the for loop too much to restructure it
        city_name = "{city}, {state}".format(city=' '.join(city_words), state=state)
        # the Happiness data uses "St." instead of "Saint"
        city_words = ["St." if word == "Saint" else word for word in city_words]
        if all([city_word in region_city_words for city_word in city_words]):
            if state in region_states:
                return city_name
    return False
happiness['city'] = happiness['city'].map(rename_regions)
happiness = happiness.loc[happiness['city'] != False]

In [35]:
# unpivot
happiness = pd.melt(happiness, id_vars=['city'], var_name='year', value_name='happiness') \
           .sort_values(['city', 'year']) \
           .reset_index(drop=True)

In [36]:
# drop NaN rows because they are worthless to our cause
happiness.dropna(inplace=True)

In [37]:
# convert to MultiIndex
happiness.set_index(['city', 'year'], inplace=True)

In [38]:
happiness.head()

                      happiness
city            year
Albany, NY      2014       59.2
                2015       60.8
                2016       59.9
Albuquerque, NM 2014       60.3
                2015       57.0

## Everything Together

In [39]:
data = income.merge(unemployment, left_index=True, right_index=True) \
             .merge(traffic, left_index=True, right_index=True)      \
             .merge(crime, left_index=True, right_index=True)        \
             .merge(happiness, how='left', left_index=True, right_index=True)
data.head()

                 median income  unemployment rate  mean commute time  \
city       year
Albany, NY 2010          73470              0.060               19.7
           2011          75821              0.065               19.9
           2012          76707              0.070               20.0
           2013          77687              0.073               20.0
           2014          78285              0.068               20.1

                  arson rate assault rate burglary rate  murder rate  \
city       year
Albany, NY 2010  0.000172576   0.00669809    0.00998781  2.15719e-05
           2011   0.00012208   0.00592089    0.00910515  4.06934e-05
           2012  0.000121957   0.00515343    0.00903378  4.07386e-05
           2013  0.000121833   0.00536976    0.00719711  8.16693e-05
           2014   0.00012171   0.00510168    0.00692733    8.114e-05

                   rape rate robbery rate theft rate vehicle theft rate  \
city       year
Albany, NY 2010  0.000453011   0.00340837  0.0376215         0.00246999
           2011  0.000335721   0.00325547  0.0357492         0.00205502
           2012   0.00043794   0.00253598  0.0335992         0.00156844
           2013   0.00030626   0.00231737  0.0331067         0.00144963
           2014  0.000547695   0.00240377  0.0312693         0.00123739

                 happiness
city       year
Albany, NY 2010        NaN
           2011        NaN
           2012        NaN
           2013        NaN
           2014       59.2

# $\textrm{Data Visualization}$

In [40]:
import matplotlib.pyplot as plt

# $\textrm{Data Anaylsis and Results}$

# $\textrm{Privacy/Ethics Considerations}$

# $\textrm{Conclusions and Discussion}$